app/views/tourist_spots/_detail.html.erb

    <li class="nav-item">
      <%= link_to "#{ tourist_spot.reviews.count}レビュー", tourist_spot_reviews_path(tourist_spot), class: 'nav-link' %>
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`tourist_spot_id` = 3