app/views/tourist_spots/_favoritebutton.erb

    <i class="fas fa-star" style='color: #FF9933'></i>
    <%= tourist_spot.favorites.count %>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`tourist_spot_id` = 3