app/views/tourist_spots/_wentbutton.html.erb

    <i class="fas fa-check-circle" style='color: green;'></i>
    <%= tourist_spot.wents.count %>
---
SELECT COUNT(*) FROM `wents` WHERE `wents`.`tourist_spot_id` = 3

    <i class="fas fa-check-circle"></i>
    <%= tourist_spot.wents.count %>
---
SELECT COUNT(*) FROM `wents` WHERE `wents`.`tourist_spot_id` = 1