app/views/tourist_spots/new.html.erb

      <span class="label label-danger">必須</span>
      <%= collection_check_boxes(:tourist_spot, :scene_ids, Scene.all, :id, :name) do |b| %>
---
SELECT `scenes`.* FROM `scenes`