app/views/tourist_spots/show.html.erb

          <td>
            <% @tourist_spot.genres.each do |genre| %>
---
SELECT `genres`.* FROM `genres` INNER JOIN `tourist_spot_genres` ON `genres`.`id` = `tourist_spot_genres`.`genre_id` WHERE `tourist_spot_genres`.`tourist_spot_id` = 3