app/views/rooms/show.html.erb

SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
---
    </div>
    <% if @room.messages.present? %>