app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `review_id`, `title`, `body`, `created_at`, `updated_at`) VALUES (1, 1, 'tes', 'dd', '2021-01-02 06:25:59', '2021-01-02 06:25:59')
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @review = @comment.review
    if @comment.save