app/controllers/coupons_controller.rb

  def index
    @coupons = Coupon.where(user_id: current_user.id).where(is_valid: '有効').all
---
SELECT `coupons`.* FROM `coupons` WHERE `coupons`.`user_id` = 2 AND `coupons`.`is_valid` = TRUE