app/controllers/favorites_controller.rb

  def create
    unless @tourist_spot.favorited_by?(current_user)
      current_user.favorites.create(tourist_spot_id: @tourist_spot.id)
---
INSERT INTO `favorites` (`user_id`, `tourist_spot_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-01-02 06:33:37', '2021-01-02 06:33:37')

  def set_tourist_spot
    @tourist_spot = TouristSpot.find(params[:tourist_spot_id])
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 1 LIMIT 1