app/controllers/genres_controller.rb

  def index
    @genre = Genre.new
    @genres = Genre.all.page(params[:page]).per(5)
---
SELECT `genres`.* FROM `genres`

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO `genres` (`name`, `genre_image_id`, `created_at`, `updated_at`) VALUES ('testGenre', '17e95a0ea5a8d174e7778058e22ec0c8e5c02214baeb31456debf2a7c3f4', '2021-01-02 01:24:06', '2021-01-02 01:24:06')