app/controllers/homes_controller.rb

SELECT `tourist_spots`.* FROM `tourist_spots`
SELECT `genres`.* FROM `genres`
SELECT `scenes`.* FROM `scenes`
---
  def top
    @user = current_user
    @tourist_spots = TouristSpot.all
    @genres = Genre.all
    @scenes = Scene.all