app/controllers/likes_controller.rb

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 3 LIMIT 1
INSERT INTO `likes` (`user_id`, `review_id`, `created_at`, `updated_at`) VALUES (1, 3, '2021-01-02 02:42:55', '2021-01-02 02:42:55')
---
  def create
    @review = Review.find(params[:review_id])
    unless @review.liked_by?(current_user)
      like = current_user.likes.new(review_id: @review.id)
      like.save

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`review_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 3
---
  def destroy
    @review = Review.find(params[:review_id])
    if @review.liked_by?(current_user)
      like = current_user.likes.find_by(review_id: @review.id)
      like.destroy