app/controllers/messages_controller.rb

INSERT INTO `messages` (`user_id`, `room_id`, `body`, `created_at`, `updated_at`) VALUES (2, 1, 'sss', '2021-01-11 14:27:52', '2021-01-11 14:27:52')
---
  def create
    message = Message.new(message_params)
    message.user_id = current_user.id
    message.save ? (redirect_to room_path(message.room)) : (redirect_back(fallback_location: root_path))

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
DELETE FROM `messages` WHERE `messages`.`id` = 1
---
  def destroy
    message = Message.find(params[:id])
    message.destroy