app/controllers/reviews_controller.rb

  def index
    @tourist_spot = TouristSpot.find(params[:tourist_spot_id])
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 3 LIMIT 1

  def create
    @tourist_spot = TouristSpot.find(params[:tourist_spot_id])
    review = @tourist_spot.reviews.new(review_params)
    review.user_id = current_user.id
    if review.save
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`user_id`, `tourist_spot_id`, `review_image_id`, `title`, `body`, `score`, `created_at`, `updated_at`) VALUES (1, 1, '8eb082468f2d4ef9ebe961fc7ddd774ed407768dd892dd4d42d6930eac68', 'レビューを', '投稿したらポイント', 3, '2021-01-02 02:41:07', '2021-01-02 02:41:07')

  def show
    @comment = Comment.new
    @comments = @review.comments.order(id: 'DESC').page(params[:page]).per(20)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`review_id` = 1

  def set_review
    @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1