app/controllers/reviews_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`tourist_spot_id` = 3
---
  def index
    @tourist_spot_reviews = Review.where(tourist_spot_id: params[:tourist_spot_id])