app/controllers/rooms_controller.rb

  def create
    room = Room.create
    # Entryモデルにログインユーザーのレコードを作成
    current_entry = Entry.create(user_id: current_user.id, room_id: room.id)
    # Entryモデルにメッセージ相手のレコードを作成
    another_entry = Entry.create(user_id: params[:entry][:user_id], room_id: room.id)
---
INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2021-01-10 12:57:24', '2021-01-10 12:57:24')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (2, 1, '2021-01-10 12:57:24', '2021-01-10 12:57:24')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-01-10 12:57:24', '2021-01-10 12:57:24')

  def show
    @room = Room.find(params[:id])
    @message = Message.new
    @another_entry = @room.entries.find_by('user_id != ?', current_user.id)
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT  `entries`.* FROM `entries` WHERE `entries`.`room_id` = 1 AND (user_id != 2) LIMIT 1