app/controllers/scenes_controller.rb

  def index
    @scene = Scene.new
    @scenes = Scene.all.page(params[:page]).per(20)
---
SELECT `scenes`.* FROM `scenes`

  def create
    @scene = Scene.new(scene_params)
    if @scene.save
---
INSERT INTO `scenes` (`name`, `scene_image_id`, `created_at`, `updated_at`) VALUES ('testScene', 'f56f7e5f9859f9ddf749ed8c41afe75c34e9870fdef07d118e50241ebdd9', '2021-01-02 01:24:24', '2021-01-02 01:24:24')