app/controllers/tourist_spots_controller.rb

  def create
    tourist_spot = TouristSpot.new(tourist_spot_params)
    tourist_spot.user_id = current_user.id
    if tourist_spot.save
      # 中間テーブルも同時に作成
      TouristSpotGenre.create(tourist_spot_id: tourist_spot.id, genre_id: Genre.find_by(name: params[:genre]).id)
      TouristSpotScene.create(tourist_spot_id: tourist_spot.id, scene_id: Scene.find_by(name: params[:scene]).id)
---
INSERT INTO `tourist_spots` (`user_id`, `name`, `spot_image_id`, `postcode`, `prefecture_code`, `address_city`, `address_street`, `address_building`, `introduction`, `access`, `phone_number`, `business_hour`, `created_at`, `updated_at`, `latitude`, `longitude`) VALUES (1, '東京ディズニーリゾート', '8a6b85ca47ce6ee7c0228aed4c31c89310ad80120a3252d65f0ccac458e7', 216, 14, '川崎市', '宮前区神木本町1-9-11', '', 'fdff', 'fdf', '09042000717', 'fdfd', '2021-01-02 02:01:26', '2021-01-02 02:01:26', 35.6035013, 139.5795614)
INSERT INTO `tourist_spot_genres` (`tourist_spot_id`, `genre_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-01-02 02:01:26', '2021-01-02 02:01:26')
SELECT  `genres`.* FROM `genres` WHERE `genres`.`name` = 'testGenre' LIMIT 1
INSERT INTO `tourist_spot_scenes` (`tourist_spot_id`, `scene_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-01-02 02:01:26', '2021-01-02 02:01:26')
SELECT  `scenes`.* FROM `scenes` WHERE `scenes`.`name` = 'testScene' LIMIT 1

  def update
    if @tourist_spot.update(tourist_spot_params)
---
UPDATE `tourist_spots` SET `impressions_count` = COALESCE(`impressions_count`, 0) + 1 WHERE `tourist_spots`.`id` = 1

  def map
    @tourist_spot = TouristSpot.find(params[:tourist_spot_id])
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 3 LIMIT 1

  def set_tourist_spot
    @tourist_spot = TouristSpot.find(params[:id])
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 3 LIMIT 1

  def set_genre_scene
    @genres = Genre.all
    @scenes = Scene.all
---
SELECT `genres`.* FROM `genres`
SELECT `scenes`.* FROM `scenes`