app/controllers/tourist_spots_controller.rb

SELECT `genres`.* FROM `genres`
SELECT `scenes`.* FROM `scenes`
---
  def new
    @tourist_spot = TouristSpot.new
    @genres = Genre.all
    @scenes = Scene.all
    @genre_names = []
    @scene_names = []
    @genres.each do |genre|
      @genre_names.push(genre.name)
    end
    @scenes.each do |scene|