app/controllers/tourist_spots_controller.rb

  def get_genre_grandchildren
    @genre_grandchildren = Genre.find(params[:child_id]).children # 選択された子ジャンルに紐付く孫ジャンルの配列を取得
---
SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1