app/controllers/users_controller.rb

SELECT  `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1 LIMIT 11
---
  def show
    @reviews = @user.reviews.page(params[:page]).per(20)
    # Entryモデルからログインユーザーのレコードを抽出
    @current_entry = Entry.where(user_id: current_user.id)
    # Entryモデルからメッセージ相手のレコードを抽出
    @another_entry = Entry.where(user_id: @user.id)