app/controllers/wents_controller.rb

  def create
    unless @tourist_spot.wented_by?(current_user)
      went = current_user.wents.new(tourist_spot_id: @tourist_spot.id)
      went.save
---
INSERT INTO `wents` (`user_id`, `tourist_spot_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-01-02 06:33:38', '2021-01-02 06:33:38')

  def set_tourist_spot
    @tourist_spot = TouristSpot.find(params[:tourist_spot_id])
---
SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 1 LIMIT 1