app/models/coupon.rb

  def self.coupon_create(user)
    time = Time.now.to_i
    coupon = Coupon.new(
      user_id: user.id,
      limit: 1
    )
    coupon.save
---
INSERT INTO `coupons` (`user_id`, `limit`, `created_at`, `updated_at`) VALUES (2, 1, '2021-01-13 08:03:29', '2021-01-13 08:03:29')