app/models/review.rb

  def liked_by?(user)
    likes.where(user_id: user.id).exists?
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` IN (2, 3, 1)

  def user_rank_update(user)
    if user.point < 10
      user.rank = 'レギュラー'
    elsif user.point < 50
      user.rank = 'シルバー'
    elsif user.point < 100
      user.rank = 'ゴールド'
    elsif user.point < 300
      user.rank = 'プラチナ'
    elsif user.point >= 300
      user.rank = 'ダイヤモンド'
    end
    user.save!
---
UPDATE `users` SET `point` = 1, `rank` = 'レギュラー', `updated_at` = '2021-01-13 07:58:12' WHERE `users`.`id` = 2