app/models/tourist_spot.rb

  def average_score
    @sum = 0
    reviews.each do |review|
      @sum += review.score
    end
    if @sum > 0
      @sum /= reviews.length
---
SELECT tourist_spots.id FROM `tourist_spots`