app/models/tourist_spot.rb

SELECT  `tourist_spots`.* FROM `tourist_spots` WHERE `tourist_spots`.`id` = 1 LIMIT 1
---
  def wented_by?(user)
    wents.where(user_id: user.id).exists?