app/models/user.rb

  def prefecture_name=(prefecture_name)
    self.prefecture_code = JpPrefecture::Prefecture.find(name: prefecture_name).code
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def self.ranking
    self.all.order(point: 'DESC').limit(10)
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`point` DESC LIMIT 10