app/models/user.rb

SELECT  `users`.* FROM `users` ORDER BY `users`.`point` DESC LIMIT 10
---
  def self.ranking
    self.all.order(point: 'DESC').limit(10)