app/views/reviews/_likebutton.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`review_id` = 1
---
    <i class="fas fa-heart" style='color: red;'></i>
    <%= review.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`review_id` = 1
---
    <i class="fas fa-heart"></i>
    <%= review.likes.count %>