app/views/reviews/_reviews.html.erb

                コメント
                <%= review.comments.count %>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`review_id` = 1