app/views/layouts/_header.html.erb

              <li>
                <% Genre.all.each do |genre| %>
---
SELECT `genres`.* FROM `genres`

              <li>
                <% Scene.all.each do |scene| %>
---
SELECT `scenes`.* FROM `scenes`