app/views/layouts/_sidebar.html.erb

            <td class="text-center">
              <%= tourist_spot.favorites.count %>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`tourist_spot_id` = 1